IDEA Open Model
Segment2D.EndPoint Property
Compatible with IDEA StatiCa Beta 20.0
 Gets or sets the endpoint of the segment.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public Point2D EndPoint { get; set; }
Public Property EndPoint As Point2D
	Get
	Set
Property Value
Type: Point2D
See Also
Reference
Segment2D Class
IdeaRS.OpenModel.Geometry2D Namespace